isunavi/SOFTWARES/_stm32/_PROJECTS/FMT/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * Copyright (c) 2016 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"
#include "fatfs.h"
#include "usb_device.h"

/* USER CODE BEGIN Includes */
#include "board.h"
#include "xprintf.h"
#include "conv.h"
#include "debug.h"
#include "ff.h"
FIL file_test;
FRESULT result;
FATFS FATFS_obj;
uint32_t str_size;
static const char file_name [] = "ADC_RAW_DATA.bin";
char _str [256];
char ch [256];
uint32_t tmpu32 = 0;
uint16_t tmpu16;

uint32_t test_core_ticks_new, test_core_ticks_old = 0;
uint32_t test_total_time_remain = 0;

UINT frcnt, fwcnt;         // счетчик записи файла
uint32_t ready_to_close = 0;
//#define show_message(a,b)

#include "modParser.h"
#include "_FIFO.h"





volatile static const uint16_t compile_date []    = { 2016, 12, 11 };
volatile static const uint16_t compile_version [] = { 8 };
volatile static const uint16_t firmware_date []   = { 2016, 12, 11 };

uint8_t tmpchar;
uint8_t respBuf [PARSER_MAX_DATA_SIZE];
uint8_t IOBuf [PARSER_MAX_DATA_SIZE];
uint8_t size8;




/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;
DMA_HandleTypeDef hdma_adc1;
DMA_HandleTypeDef hdma_adc2;

CRC_HandleTypeDef hcrc;

DAC_HandleTypeDef hdac;

RTC_HandleTypeDef hrtc;

SD_HandleTypeDef hsd;
HAL_SD_CardInfoTypedef SDCardInfo;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DAC_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM12_Init(void);

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
uint32_t USB_error_cnt;
uint8_t show_message (char *buf)
{
    uint32_t test_cnt = 0;
    uint16_t size;
    
    size = _strlen (buf);
    //memcpy ((void *)_str, buf, size);
    strcat ((char *)buf, "\r\n");
    size += 2;
    if (HAL_OK != HAL_UART_Transmit_IT (&huart1, (uint8_t *)&buf[0], size))
    {
        //do nothing
    }
    else
    {
repeat: //TODO
        if (USBD_OK != CDC_Transmit_FS((uint8_t *)&buf[0], size))
        {
            USB_error_cnt++;
            if (++test_cnt >= 10)
            {
                return 1;
            }
            else
            {
                HAL_Delay (1); //~10ms
                goto repeat;
            }
        }
        else
        {
            return 0;
        }
    }
}


uint8_t show_message_c (const char *str)
{
#if _DEBUG
    xsprintf (_str, "%s", str);
    show_message (_str);
#endif
}


// CONF --------------------------------
typedef struct FMT_t_ {
    uint8_t  ADC_mode; //TODO
    uint32_t ADC_period;
    uint32_t ADC_collect_size;
    bool_t ADC_flag_ready;
    
    uint32_t cnt_wr;
    uint32_t cnt_rd;

    uint32_t cnt_error_wr ;

    uint32_t cnt_error_ALL ;
    bool_t file_opened;

} FMT_t;

FMT_t FMT;


