isunavi/SOFTWARES/_stm32/_PROJECTS/FMT/Src/main.c
static FIFO_t FIFO_UART_RX; //TODO malloc
#define FIFO_UART_RX_SIZE          256 /*** Must be a power of 2 (2,4,8,16,32,64,128,256,512,...) ***/
static uint8_t FIFO_UART_RX_buf [FIFO_UART_RX_SIZE];


static FIFO_t FIFO_ADC; //TODO malloc
#define FIFO_ADC_SIZE              4096 /*** Must be a power of 2 (2,4,8,16,32,64,128,256,512,...) ***/
static uint8_t FIFO_ADC_buf [FIFO_ADC_SIZE];

#define ADC_BUF_SIZE                4
//#define ADC_DATA_COLLECT            1000000 // all data = ADC_BUF_SIZE * ADC_DATA_COLLECT


#pragma pack(push, 1) //for pucked data structures
struct parser_data_t {
    uint8_t     start; // позиция внутреннего автомата, не трогать
    uint8_t     adress; // адрес, на который нужно ответить
    uint8_t     reciv_cnt;
    uint16_t    adc1_value_out [ADC_BUF_SIZE];
    uint16_t    adc2_value_out [ADC_BUF_SIZE];
    //uint32_t     timer;
    uint32_t    cnt;
    uint16_t    crc;
    uint8_t     end;
} parser_data;
#pragma pack(pop) 

#define ADC_BUF_ALL_SIZE (ADC_BUF_SIZE * 2 )
#define PARSER_OUT_SIZE     (10 + ADC_BUF_ALL_SIZE) //size our packet


__IO uint16_t ADC3_buf [ADC_BUF_SIZE];
uint16_t ADC3_pointer = 0;

enum { ADC_BUFFER_LENGTH = 10 };
uint32_t g_ADCBuffer [ADC_BUFFER_LENGTH];
uint16_t g_ADCValue;
uint32_t g_MeasurementNumber = 0;

void HAL_ADC_ConvCpltCallback (ADC_HandleTypeDef* hadc) //TODO check that adc1 first!!!
{
    if (hadc->Instance == ADC1)
    {
        /*
        for (i = 0; i < ADC_BUFFER_LENGTH; i++)
        {
            tmp32 += ADC1_buf [i];
        }
        parser_data.adc_value_out [0] =  tmp32 / ADC_BUF_SIZE; //std::accumulate(g_ADCBuffer, g_ADCBuffer + ADC_BUFFER_LENGTH, 0) / ADC_BUFFER_LENGTH;
        //g_MeasurementNumber += 1;//ADC_BUFFER_LENGTH;
       */
        /*
        for (i = 0; i < ADC_BUFFER_LENGTH; i++)
        {
            parser_data.adc_value_out [0 + i] = ADC1_buf [i];
        }
        */
    }
    
    if (hadc->Instance == ADC2)
    {
        /*
        for (i = 0; i < ADC_BUFFER_LENGTH; i++)
        {
            parser_data.adc_value_out [10 + i] = ADC2_buf [i];
        }
        */
        //g_MeasurementNumber += 1;
        //parser_data.cnt = g_MeasurementNumber;

        //crc...

        //if (USBD_OK != CDC_Transmit_FS ((uint8_t *)&parser_data, PARSER_OUT_SIZE))
        {
        }
        
        if (FMT.ADC_flag_ready == TRUE)
        {
            FMT.cnt_wr++;
            if (TRUE != FIFO_puts (&FIFO_ADC, (uint8_t *)&parser_data.adc1_value_out [0], ADC_BUF_ALL_SIZE))
            {
                FMT.cnt_error_wr++;
            }
            if (FMT.cnt_wr >= (FMT.ADC_collect_size + 1)) //ТОМУ ЩО
            {
                HAL_TIM_Base_Stop (&htim2); 
            }
        }
    }
}


typedef enum {
    FMT_CMD_TEST                    = 'T',
    FMT_CMD_GET_DEV_ID              = 'I',
    FMT_CMD_GET_FIRMWARE_VER        = 'V',
   
    FMT_CMD_ADC_GET_VBAT            = 'B', //2,3 - number channel
    
    FMT_CMD_DAC_SET_CHANNEL_VALUE   = 'D', //1,2 - number channel
    
    FMT_CMD_FAT_RESET               = 'R',
        
    FMT_CMD_ADC_START               = '1',
    FMT_CMD_ADC_SET_PERIOD          = 'P',
    FMT_CMD_ADC_SET_BUF_SIZE        = 'S',
    FMT_CMD_ADC_STOP                = '2',
    
    FMT_CMD_FAT_GET                 = 'G',
    
    
} FMT_CMD;


parser_t parser;

__IO ITStatus UartReady = RESET;
/* Buffer used for reception */
uint8_t aRxBuffer [128];


void HAL_UART_TxCpltCallback (UART_HandleTypeDef *UartHandle)
{
  /* Set transmission flag: transfer complete */
    UartReady = SET;
}

/**
  * @brief  Rx Transfer completed callback
  * @param  UartHandle: UART handle
  * @note   This example shows a simple way to report end of DMA Rx transfer, and 
  *         you can add your own implementation.
  * @retval None
  */
void HAL_UART_RxCpltCallback (UART_HandleTypeDef *UartHandle)
{
    /* Set transmission flag: transfer complete */
    FIFO_put (&FIFO_UART_RX, aRxBuffer [0]);
    UartReady = SET;
    if (HAL_UART_Receive_IT (&huart1, (uint8_t *)aRxBuffer, 1) != HAL_OK)
    {
        Error_Handler();
    }
}

/**
  * @brief  UART error callbacks
  * @param  UartHandle: UART handle
  * @note   This example shows a simple way to report transfer error, and you can
  *         add your own implementation.
  * @retval None
  */
void HAL_UART_ErrorCallback (UART_HandleTypeDef *UartHandle)
{
  /* Turn LED_ORANGE on: Transfer error in reception/transmission process */
  //BSP_LED_On(LED_ORANGE); 
  //Error_Handler();
}


static uint32_t *UID = (uint32_t *)0x1FFF7A10; // 0x1FFFF7E8 for STM32F100


// for drvSPIFLASH -----------------------------------------
void halSPIFLASH_GPIO_SPI_init (void) //already init ready
{
    __HAL_SPI_ENABLE (&hspi1);
}


uint8_t halSPIFLASH_xspi (uint8_t byte)
{
    while (0 == (SPI1->SR & SPI_SR_TXE)) {};
    SPI1->DR = byte;
    while (!(SPI1->SR & SPI_SR_RXNE)) {};
    return SPI1->DR;
}


void drvBUZZER_on (void)
{
    if (HAL_TIM_PWM_Start (&htim12, TIM_CHANNEL_2) != HAL_OK)
    {
    }
}

void drvBUZZER_off (void)
{
    if (HAL_TIM_PWM_Stop (&htim12, TIM_CHANNEL_2) != HAL_OK)
    {
    }
}

void drvBUZZER_peep (uint8_t i)
{
    while (i)
    {
        drvBUZZER_on (); //end init pika
        HAL_Delay (40);
        drvBUZZER_off ();
        HAL_Delay (90);
        i--;
    }
}


void FAT_reinit (void)
{
    // CD card off-on!
    HAL_GPIO_WritePin (GPIOC, GPIO_SD_ONOFF_Pin, GPIO_PIN_SET);
    HAL_Delay (200); // ~300ms
    HAL_GPIO_WritePin (GPIOC, GPIO_SD_ONOFF_Pin, GPIO_PIN_RESET);
    
    result = f_mount (&FATFS_obj, "0", 1);
    if ((FR_NOT_READY == result) ||
        (FR_DISK_ERR == result) ||
        (FR_INVALID_DRIVE == result))
    {
        show_message_c ("   SD/FAT init ERROR");
        drvBUZZER_peep (1);
    }
    else
    {
        
    }
    
    tmpu32 = 0;
    if (1 == tmpu32)
    {
        result = f_mkfs ("0", 0, 512);
        if (FR_OK != result)
        {
            show_message_c ("SD/FAT mount disk");
        }
        else
        {
            show_message_c ("make FAT error");
            drvBUZZER_peep (2);
        }
    }
    /*
    if (FR_NO_FILESYSTEM == result)
    {
        result = f_mkfs ("0", 0, 512);
        if (FR_OK != result)
        {
            
