isunavi/SOFTWARES/_stm32/_PROJECTS/FMT/Src/main.c
        }
    }
    */
    
    if (FR_OK == result)
    {
        show_message_c ("   SD/FAT init OK");
        //...
    }
    
    FMT.file_opened = FALSE;
}


void ADC_init (void)
{

    //TIM_ClockConfigTypeDef sClockSourceConfig;
    //TIM_MasterConfigTypeDef sMasterConfig;
    htim2.Instance = TIM2;
    htim2.Init.Prescaler = 168 -1;
    htim2.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim2.Init.Period = FMT.ADC_period;
    htim2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    if (HAL_TIM_Base_Init (&htim2) != HAL_OK)
    {
        Error_Handler();
    }

    // step (1) - start TIMER
    HAL_TIM_Base_Start (&htim2);
    
    // step (2) - start ADC
    if (HAL_ADC_Start_DMA (&hadc1,
        (uint32_t *)&parser_data.adc1_value_out [0],
        ADC_BUF_SIZE) != HAL_OK)
    {  
    }
        
    if (HAL_ADC_Start_DMA (&hadc2,
        (uint32_t *)&parser_data.adc2_value_out [0],
        ADC_BUF_SIZE) != HAL_OK)
    {
    }
    
    FMT.cnt_error_ALL = 0;
    FMT.cnt_error_wr = 0;
    FMT.cnt_wr = 0;
}


/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DAC_Init();
  MX_SDIO_SD_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();
  MX_USB_DEVICE_Init();
  MX_TIM2_Init();
  MX_FATFS_Init();
  MX_RTC_Init();
  MX_TIM12_Init();

  /* USER CODE BEGIN 2 */
    _debug_init ();
    __enable_irq (); // enable interrupts!!!
    
    if (HAL_UART_Transmit_IT (&huart1, (uint8_t *)"\r\n\r\nInit start...\r\n", 19)!= HAL_OK)
    {
        Error_Handler();
    }

    if (HAL_UART_Receive_IT (&huart1, (uint8_t *)aRxBuffer, 1) != HAL_OK)
    {
        Error_Handler();
    }
    
    
    drvSPIFLASH_init (0);

    // init CDC out struct
    parser_data.start = PIK_START;
    parser_data.reciv_cnt = 8;
    parser_data.crc = 0x4545;
    parser_data.end = PIK_FIN;

    modParser_init (&parser, '#'); //'#' - address
    modParser_reset (&parser);
    
    //TODO check init
    FIFO_init (&FIFO_UART_RX, &FIFO_UART_RX_buf[0], FIFO_UART_RX_SIZE);
    FIFO_flush (&FIFO_UART_RX);
    
    FIFO_init (&FIFO_ADC, &FIFO_ADC_buf[0], FIFO_ADC_SIZE);
    FIFO_flush (&FIFO_ADC);

    FMT.ADC_mode = 0; //TODO
    FMT.ADC_collect_size = 10000;
    FMT.ADC_period   = 1000;
    FMT.ADC_flag_ready = FALSE;
    FMT.file_opened = FALSE;
    ADC_init ();
    
    //DAC on
    HAL_DAC_SetValue (&hdac, DAC_CHANNEL_1, DAC_ALIGN_12B_R, 0);
    HAL_DAC_SetValue (&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, 0);
    uint32_t DACcnt = 0;
    if (HAL_DAC_Start (&hdac, DAC_CHANNEL_1) != HAL_OK)
    {
    }
    if (HAL_DAC_Start (&hdac, DAC_CHANNEL_2) != HAL_OK)
    {
    }
   

    
    HAL_Delay (500); //for init SD-CARD and not often mount\open\etc

    // CD card on!
    FAT_reinit ();
    
    test_core_ticks_new = 0;
    test_core_ticks_old = 0;
    
    drvBUZZER_peep (1); //end init OK - 1 peep
    show_message_c ("Init complite");
    show_message_c ("---------------------------------------------");
    while (1)
    {
        RESET_CORE_COUNT;
 
        // 0A 23 09 47 00 00 01 00 30 30 30 30 35 35 0D
        if (TRUE == FIFO_gets (&FIFO_UART_RX, &tmpchar, 1)) 
        {
            if (FUNCTION_RETURN_OK == modParser_reciv (&parser, tmpchar, &IOBuf[0], &size8))
            {
                uint32_t digit_uint32 = (uint32_t)(IOBuf [1] << 24 | IOBuf [2] << 16 | IOBuf [3] << 8 | IOBuf [4]);
                switch (IOBuf [0]) // parsing command
                {
                case FMT_CMD_TEST: //T
                    size8 = xsprintf (_str, "[%u.%u]%u ", HAL_GetTick (), test_core_ticks_old);
                    break;
                    
                case FMT_CMD_GET_DEV_ID: //I
                    size8 = xsprintf (_str, "ID:0x%08X%08X%08X ", UID [0], UID [1], UID [2]);
                    break;
                    
                case FMT_CMD_GET_FIRMWARE_VER: //V
                    size8 = xsprintf (_str, "date %u.%u.%u v[%u] ", compile_date [0], compile_date [1], compile_date [2], compile_version [0]);
                    break;
                    
                case FMT_CMD_ADC_GET_VBAT: //B2(3)
                    ADC_ChannelConfTypeDef sConfig;
                    if ('2' == IOBuf [1])
                    {
                        sConfig.Channel = ADC_CHANNEL_2;
                        sConfig.Rank = 1;
                        sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
                        if (HAL_ADC_ConfigChannel (&hadc3, &sConfig) != HAL_OK)
                        {
                            Error_Handler();
                        }
                        HAL_ADC_Start (&hadc3);
                        HAL_ADC_PollForConversion (&hadc3, 1000);
                        if (++ADC3_pointer >= ADC_BUF_SIZE)
                        {
                            ADC3_pointer = 0;
                        }
                        tmpu16 = HAL_ADC_GetValue (&hadc3);
                        //ADC3_buf [ADC3_pointer] = tmpu16;
                        size8 = xsprintf (_str, "ADC3 ch%c :%u", IOBuf [1], tmpu16);
                    }
                    else if ('3' == IOBuf [1])
                    {
                        sConfig.Channel = ADC_CHANNEL_3;
                        sConfig.Rank = 1;
                        sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
                        if (HAL_ADC_ConfigChannel (&hadc3, &sConfig) != HAL_OK)
                        {
                            Error_Handler();
                        }
                        HAL_ADC_Start (&hadc3);
                        HAL_ADC_PollForConversion (&hadc3, 1000);
                        if (++ADC3_pointer >= ADC_BUF_SIZE)
                        {
                            ADC3_pointer = 0;
                        }
                        tmpu16 = HAL_ADC_GetValue (&hadc3);
                        //ADC3_buf [ADC3_pointer] = tmpu16;
                        size8 = xsprintf (_str, "ADC3 ch%c :%u", IOBuf [1], tmpu16);
                    }
                    else
                    {
                        size8 = xsprintf (_str, "ADC3 channel error!");
                        drvBUZZER_peep (1);
                    }
                    break;
                    
                case FMT_CMD_DAC_SET_CHANNEL_VALUE: //D1(2)
                    if ('1' == IOBuf [1])
                    {
                        HAL_DAC_SetValue (&hdac, DAC_CHANNEL_1, DAC_ALIGN_12B_R, (uint16_t)(IOBuf [2] << 8) | IOBuf [3]);
                        size8 = xsprintf (_str, "DAC 1 OK ");
                    }
                    else if ('2' == IOBuf [1])
                    {
                        HAL_DAC_SetValue (&hdac, DAC_CHANNEL_2, DAC_ALIGN_12B_R, (uint16_t)(IOBuf [2] << 8) | IOBuf [3]);
                        size8 = xsprintf (_str, "DAC 2 OK ");
                    }
                    else
                    {
                        size8 = xsprintf (_str, "DAC channel error!");
                        drvBUZZER_peep (1);
                    }
                    break;

