isunavi/SOFTWARES/_stm32/_PROJECTS/FMT/Src/main.c
                case FMT_CMD_ADC_SET_PERIOD: //Pxxxx
                    FMT.ADC_period = digit_uint32;
                    size8 = xsprintf (_str, "Period OK - %u ", FMT.ADC_period);
                    break;
                    
                case FMT_CMD_ADC_SET_BUF_SIZE: //Sxxxx
                    FMT.ADC_collect_size = digit_uint32;
                    size8 = xsprintf (_str, "ADC size OK - %u ", FMT.ADC_collect_size);
                    break;
                    
                case FMT_CMD_FAT_RESET: //R
                    FAT_reinit ();
                    break;
                    
                case FMT_CMD_ADC_START: //1 - start collect adc data
                    result = f_open (&file_test, file_name, FA_WRITE);
                    if (FR_OK != result)
                    {
                        result = f_open (&file_test, file_name, FA_CREATE_ALWAYS | FA_WRITE);
                        if (FR_OK != result)
                        {
                            show_message_c ("FAT file fist creating error!");
                            drvBUZZER_peep (3);
                            //while (1) ;
                        }
                        else
                        {
                            show_message_c ("FAT file fist creating");
                        }
                    }
                    show_message_c ("FAT file open OK");
                    //...
        
                    result = f_lseek (&file_test, 0);
                    if (FR_OK != result)
                    {
                        show_message_c ("FAT seek ERROR");
                        //while (1) {};
                    }
                    else
                    {
                        show_message_c ("FAT seek OK");
                        test_total_time_remain = HAL_GetTick ();
                        xsprintf (_str, "[%u.%u] START ADC COLLECT DATA", test_total_time_remain, SysTick->VAL);
                        show_message (_str);
                        ADC_init ();
                        FMT.ADC_flag_ready = TRUE; //START!!!!
                        uint32_t delay_blink = HAL_GetTick();
                        while (1)
                        {
                            if ((HAL_GetTick() - delay_blink) >= 1000) //status output
                            {
                                delay_blink = HAL_GetTick();
                                if (FALSE != FMT.ADC_flag_ready)
                                {
                                    xsprintf (_str, "%u0 * 2 collect...", FMT.cnt_wr);
                                    show_message (_str);
                                }
                            }
                            if (TRUE == FIFO_gets (&FIFO_ADC, (uint8_t *)_str, ADC_BUF_ALL_SIZE))
                            {
                                FMT.cnt_rd++;
                                result = f_write (&file_test, (uint8_t *)&_str[0], ADC_BUF_ALL_SIZE, &fwcnt); // Запись куска в файл
                                if ((FR_OK != result) || (fwcnt < str_size)) //ошибка, если диск переполнен
                                {
                                    show_message_c ("FAT file write ERROR");
                                    result = f_close (&file_test); //Update file size in here
                                    if (result != FR_OK)
                                    {
                                        show_message_c ("FILE file close ERROR");
                                    }
                                    while (1) {};
                                }
                                if (FMT.cnt_wr >= (FMT.ADC_collect_size + 1)) //ТОМУ ЩО
                                {
                                    result = f_close (&file_test); //Update file size in here
                                    if (result != FR_OK)
                                    {
                                        show_message_c ("FILE close ERROR");
                                    }
                                    xsprintf (_str, "[%u.%u] ADC END COLLECT %u DATA", HAL_GetTick () - test_total_time_remain, SysTick->VAL, (FMT.cnt_wr - 1));
                                    show_message (_str);
                                    FMT.ADC_flag_ready = FALSE;
                                    drvBUZZER_peep (1);
                                    break; //while (1) {};
                                }
                            }
                        };
                        /*
                        str_size = 4;//xsprintf (_str, file_kml_head);
                        result = f_write (&fileKML, _str, str_size, &fwcnt); // Запись куска в файл
                        if ((FR_OK != result) || (fwcnt < str_size)) //ошибка, если диск переполнен
                        {
                            show_message ("FILE wr ERROR", 24);
                            while (1) {};
                        }
                        else
                        {
                            // emergency out!!!
                            break;
                        }
                        */
                    } //else 
                    size8 = xsprintf (_str, "ADC collect data ready!:%u ", tmpu16);
                    break;

                case FMT_CMD_ADC_STOP: //2 - stop collect adc data
                    //ADC_deinit ();
                    HAL_TIM_Base_Stop (&htim2);
                    FMT.ADC_flag_ready = FALSE; //START!!!!

                    result = f_close (&file_test); //Update file size in here
                    if (result != FR_OK)
                    {
                        show_message_c ("FAT file close ERROR");
                    }
                    xsprintf (_str, "[%u.%u] ADC END COLLECT %u DATA", HAL_GetTick () - test_total_time_remain, SysTick->VAL, (FMT.cnt_wr - 1));
                    show_message_c (_str);

                    drvBUZZER_peep (1);

                    size8 = xsprintf (_str, "ADC collect stop!");
                    break;


                    
